app/controllers/gists_controller.rb

  def index
<<<<<<< HEAD
       @gists = Gist.paginate(:page => params[:page]).search(params[:search])
---
SELECT "gists".* FROM "gists" WHERE (description LIKE '%ruby%') LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "gists" WHERE (description LIKE '%hw%')

  def create
    @gist = Gist.new(gist_params)

    respond_to do |format|
      if @gist.save
---
INSERT INTO "gists" ("created_at", "description", "lang", "snippet", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @gist.update(gist_params)
---
UPDATE "gists" SET "snippet" = ?, "updated_at" = ? WHERE "gists"."id" = 2  [["snippet", "#include<stdio.h>\r\n\r\nmain()\r\n{\r\n    printf(\"Hello World\");\r\n\r\n\r\n}"], ["updated_at", Thu, 27 Mar 2014 14:21:48 UTC +00:00]]

  def destroy
    @gist.destroy
---
DELETE FROM "gists" WHERE "gists"."id" = ?  [["id", 3]]

    def set_gist
      @gist = Gist.find(params[:id])
---
SELECT "gists".* FROM "gists" WHERE "gists"."id" = ? LIMIT 1  [["id", "3"]]